TAONAW.org
#+TITLE: TAONAW Hugo Version
#+OPTIONS: num:nil toc:nil \n:nil
#+TODO: TODO(t) CANCELLED(c) |  WIP(w) PUBLISHED(p)
#+hugo_base_dir: .
#+hugo_auto_set_lastmod: %Y-%m-%d


:PROPERTIES:
:EXPORT_HUGO_SECTION:
:END:
*** PUBLISHED Upgrading my Audio Game                                 :music:
    :PROPERTIES:
    :EXPORT_HUGO_SECTION: Help Desk Head Desk 
    :EXPORT_FILE_NAME: upgrading-audio-game
    :EXPORT_HUGO_PUBLISHDATE: 2019-04-09:
    :END:
 
After a few months of research, I finally upgraded my Audio system on my PC. As it turns out, it wasn't as expensive as I feared. The renewed interest in music took me in rewarding directions of sound exploration I did not anticipate.
 
 #+hugo: more

**** First Steps: FLAC Files

As a teenager, I was first introduced to sound on a computer with [[https://en.wikipedia.org/wiki/Sound_Blaster][Sound Blaster]] back in the 90s in the first [[https://en.wikipedia.org/wiki/Prince_of_Persia_(1989_video_game)][Prince of Persia]] game. Until then I was not aware computers could produce better sounds than 8-bit beeps. Music, up to that point, was either somewhat of low quality on the radio or high quality through a stereo system which my dad owned at the time. 

that experience made me believe that if I want to get serious about audio today, I can't start my journey just by looking at better headsets. As [[https://www.rousette.org.uk/][one of my favorite bloggers]] BSIAG wrote to me in an email: "the best way is to start with improving the source, and work your way towards the output (speakers or headphones)."

The first step sounded easy enough: using lossless [[https://en.wikipedia.org/wiki/FLAC][FLAC]] files instead of MP3s and other lossy-compressed formats that are usually available on popular streaming services. But, if the popular streaming services (like Spotify, Apple Music, and Google Music) do not provide lossless audio, how do you get the good stuff? 

The Library. Armed with my card, I ordered a couple of CDs from the online catalog to be delivered to my local branch. I picked up a few recordings, and after quick research settled on [[https://abcde.einval.com/wiki/][ABCDE]] (that's "A Better CD Encoder". Catchy, eh?) to rip the CDs into FLAC format. It did a fine job, [[http://www.andrews-corner.org/linux/abcde/abcde_lossless.html][connecting to CDDB to find artists names and downloading album art as well]]. I repeated the process for a few classical CDs, exploring different sounds. I also tried a few CDs I already owned and learned an important lesson: many modern CDs are already created flat and prepared for loudness. In these cases, FLAC format did not do much to the sound quality. In other words, if you listen to Marlyn Manson's beautiful people on a streaming service or a CD, there's virtually no difference in the richness of the sound. That's because the richness I'm speaking of is present in the variation of different volume levels of parts of the track. For example, the artist's breathing, their finger sliding on the strings, certain bass sounds, etc. have different level volumes which make the track more whole and "multi-dimensional" where a processed recording often flattens it out, usually drowning the other sounds out completely. This is why, perhaps, some people swear that live recordings are much better; in-studio recordings are more proccessed and hence probably flatter.

I'm lucky to have a sound engineer in the family who loves and works with indie artists for the most part. When I told him about my quest toward better music, he pointed me at [[https://bandcamp.com/][Bandcamp]]. 

Bandcamp is a site that pays artists directly and much more than streaming services do. At the same time, it keeps digital works in FLAC format for download. You pay for a CD, usually as much as you want, and the Music is yours to save on your computer with the artist's thanks and blessing. Bandcamp remembers what CDs you bought and slowly suggests new artists and people who follow them for more music. For the last month or so I found myself doing something I haven't done in decades: buying music albums. My growing collection already includes 10 digital albums that make want to come back home and do nothing more than sit in my chair, close my eyes, listen and enjoy. 

**** Equipment: DACs, AMPs, and Getting my Headset

Another thing BSIAG helped me with is to solidify the concept of a DAC ([[https://www.whathifi.com/advice/dacs-everything-you-need-to-know][Digital to Aanalog Converter]]). Until that point, I knew there's this "box" serious music lovers and sound engineers connect their ultra-expensive headset. As it turns out, there's a whole world of technology behind DACs and AMPs. 

I can't go deep into it here because I have only basic understanding of it myself, but the general idea is that DACs convert the digital information (think 1s and 0s) in your computer to analog (wave-like, the stuff we can actually hear) information. All modern computers and phones come with a built-in DACs (which is why you can just plug in a pair of earphones directly into your iPhone, for example), but these are very basic. an AMP (or simply an amplifier) is a device that amplifies certain signals - in our case, sound signals. Why would you need all this volume pushing into your head? Isn't it a bad idea? 

Well, turns out high-quality headphones /resist/ the electrical current more than cheap ones. I'm not sure about the exact science behind this, but it's measured in impedance. Better (and usually more expensive) headphones = higher resistance (impedance) = more power (stronger AMP). There's much more to this than I'm explaining here. take a look at this [[https://www.youtube.com/watch?v=MDbh7yDVFL8][YouTube video]] that explains some of these concepts if you're interested.

By the time I was ready to buy the DAC and the headphones, my partner got a job offer from a professional audio store in mid-town Manhattan, [[https://audio46.com/][Audio46]]. I've heard good things about this place from the same family guy (har har) who told me about Bandcamp, and now that a visit to the store came with a lunch-date with my partner, there was no excuse not to check the place out. And I'm happy that I did. I don't want to just blast them with praises (obviously I'm not objective) but a few things are important to note. First, they didn't move a dollar beyond the budget I specified. These things are expensive, and as a person who's only entering this world of sound, I'm probably a good target for folks to get me to buy expensive equipment I may or may not need. Not here. I gave my price range and they made sure to stay in that range. Second, I was able to choose and try on several headphones with my own music before committing to anything, and let me tell you, I took my time (at the end of the visit I was told some people can try different equipment for hours). Their patience and ability to gracefully work with other customers while still checking on me is a different experience than the kind you get in  Best Buy, for sure. Third, knowledge. Some of the things I explained above were completely alien to me before I walked into this store. It wasn't just a shopping experience, it was a learning experience as well. 

I ended up buying the basic but popular [[https://audio46.com/products/fiio-q1-mark-ii-native-dsd-dac-amp-headphone-amplifier-for-iphone-ipod-ipad][FIIO Q1]] for a DAC, which works on my phone just as well as it works on my computer, and a pair of the [[https://audio46.com/products/beyerdynamic-dt-880-600-ohm-premium-headphones][Beyerdynamic DT-880]]. Because I'm starting out, I wanted something that would also work on my phone when I'm traveling or want to listen to music on the go and not just at home. The guy at Audio46 gave me a pair of the 32 OHMs, which might not be as high-end as the 250 and the 600 OHMs, but I agree with the phone-also consideration. As I grow in my audiophile-ish ways, this pair (and probably the DAC) will become my mobile kit, while I'd get something more serious for home only that (I assume) will require more power than from a USB port alone. With this particular set I can't pick up the difference between 320kbps mp3 and a lossless wav in this [[https://www.npr.org/sections/therecord/2015/06/02/411473508/how-well-can-you-hear-audio-quality][NPR test]], but I picked up the difference between 128kbps and the rest every time. In Google Music though, I could hear a difference between my FLACs and the same files after uploading them to the service, which compresses them to 320kbps, right away. So maybe Google compresses harder than it lets you know. Whatever the case, I'm very satisfied with my growing lossless FLAC collection.    

**** Rediscovering Music

After almost two weeks with my new equipment, I think the biggest self-upgrade I got out of it is rediscovering music that I like and appreciating the artists who made it. I've found artists that create amazing music on Bandcamp like [[https://brunosanfilippo.bandcamp.com/][Bruno Sanfilippo]] and [[https://thevirtualconductor.bandcamp.com/][Eamonn Watt]]. I discovered a new use for my reading corner, which now doubles as my listening corner. It's very relaxing to close my eyes after a day at work in front of computers all day and just let the music flow in for a few minutes; It's like taking a mental shower. This was an important upgrade, and I'm very happy I finally took this step.

# Expand in source

# in the [[https://www.npr.org/sections/therecord/2015/06/02/411473508/how-well-can-you-hear-audio-quality][NPR test]] I wasn't able to tell the difference between non-compressed and 320MP3, though 128MP3 stood out in suckness. 


# ** Source (Bandcamp)
# But getting hifi good indie music on the cheap is not the only benefit of the site. As I started using it more and more, I discovered it has a daily and a weekly newsletter (on the site itself) with new and listen-worthy artists. As you learn which artists you like more, you can get more similar music from artists that follow and recomment the artist you like. This resulted in some great music I would have never dicovered from streaming services, which seem to always repeate a select few "seed" songs that create random play lists (not to mention, the streaming music on these sites is of lower quality, usually 128kbs MP3s).  

